Revit 2027 API
ConnectorElement.CoordinateSystem Property
The coordinate system of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Transform CoordinateSystem { get; }
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
abstract CoordinateSystem : Transform with get
override CoordinateSystem : Transform with get
Property Value
Transform
Implements
IConnector.CoordinateSystem
Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace